examples/flows/compiled/if_elif_else/flow.dot
digraph "if_elif_else" {
    rankdir=TB;
    node [shape=box, style=filled, fontname="Helvetica"];

    end_if_elif_else_flow [label="end_if_elif_else_flow", fillcolor=palegreen];
    handler_default [label="handler_default", fillcolor=lightblue];
    handler_finalize [label="handler_finalize", fillcolor=lightblue];
    handler_type_a [label="handler_type_a", fillcolor=lightblue];
    handler_type_b [label="handler_type_b", fillcolor=lightblue];
    handler_validate [label="handler_validate", fillcolor=lightblue];
    router_if_elif_else_flow_line_14_if_2 [label="router_if_elif_else_flow_line_14_if_2", fillcolor=wheat];
    router_if_elif_else_flow_line_16_if_1 [label="router_if_elif_else_flow_line_16_if_1", fillcolor=wheat];
    start_if_elif_else_flow [label="start_if_elif_else_flow", fillcolor=palegreen];

    start_if_elif_else_flow -> handler_validate;
    handler_validate -> router_if_elif_else_flow_line_14_if_2;
    router_if_elif_else_flow_line_16_if_1 -> handler_type_b [label="p['type'] == 'B'"];
    router_if_elif_else_flow_line_16_if_1 -> handler_default [label="not (p['type'] == 'B')"];
    router_if_elif_else_flow_line_14_if_2 -> handler_type_a [label="p['type'] == 'A'"];
    handler_type_a -> handler_finalize;
    router_if_elif_else_flow_line_14_if_2 -> router_if_elif_else_flow_line_16_if_1 [label="not (p['type'] == 'A')"];
    handler_type_b -> handler_finalize;
    handler_default -> handler_finalize;
    handler_finalize -> end_if_elif_else_flow;
}
